
# 반지름에 따라 원의 면적과 넓이를 계산하는 프로그램 작성하기

print('반지름: ', 4.0)
print('원의 면적은 =', 3.141592 * 4.0 * 4.0) # pi * r^2
print('원의 둘레는 = ', 2.0 * 3.141592 * 4.0) # 2 pi r

### 반지름 7.2인 원의 면적과 넓이를 계산하시오.
print('반지름: ', 7.2)
print('원의 면적은 =', 3.141592 * 7.2 * 7.2) # pi * r^2
print('원의 둘레는 = ', 2.0 * 3.141592 * 7.2) # 2 pi r


## 컴퓨터가 이렇게 불편하면 왜 사용하는가....

## 변수를 사용하자.

radius = 123
print('반지름은 : ', radius)
print('원의 면적은 =', 3.141592 * radius * radius) # pi * r^2
print('원의 둘레는 = ', 2.0 * 3.141592 * radius) # 2 pi r

